---
kind: method
id: M:Autodesk.Revit.DB.View.HideActiveWorkPlane
zh: 视图
source: html/d011e371-c9c4-ddd9-98cf-0f86cdb8050d.htm
---
# Autodesk.Revit.DB.View.HideActiveWorkPlane Method

**中文**: 视图

Hide the active work plane of the view.

## Syntax (C#)
```csharp
public void HideActiveWorkPlane()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility.